# Задание 1.
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

name = "John"
age = 30
city = "New-York"

print("User:", name, age, city, sep=", ")

surname = input("Фамилия: ")
u_name = input("Имя: ")
app_number = int(input("Номер заявки:"))

print("Данные пользователя:", surname, u_name, app_number, sep=", ")

